app/controllers/honeybees_controller.rb

  def index
    @honeybees = Honeybee.all
---
SELECT "honeybees".* FROM "honeybees"

  def update
    if @honeybee.update_attributes(params[:honeybee])
---
UPDATE "honeybees" SET "name" = 'Wasp', "description" = '', "location" = '', "updated_at" = '2013-07-29 18:58:38.776116' WHERE "honeybees"."id" = 1

  def create
    @honeybee = Honeybee.new(params[:honeybee])
    @honeybee.user = current_user
  if @honeybee.save
---
INSERT INTO "honeybees" ("created_at", "description", "location", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 29 Jul 2013 17:10:01 UTC +00:00], ["description", ""], ["location", ""], ["name", "Melissa"], ["updated_at", Mon, 29 Jul 2013 17:10:01 UTC +00:00]]

  def find_honeybee
    @honeybee = Honeybee.find(params[:id])
---
SELECT "honeybees".* FROM "honeybees" WHERE "honeybees"."id" = ? LIMIT 1  [["id", "1"]]